MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60DN512ZVLQ10/mcu.h
#define SIM_SOPT1                     (*((volatile uint32_t *)0x40047000))      // System Options Register 1
#define SIM_SOPT2                     (*((volatile uint32_t *)0x40048004))      // System Options Register 2
#define SIM_SOPT4                     (*((volatile uint32_t *)0x4004800C))      // System Options Register 4
#define SIM_SOPT5                     (*((volatile uint32_t *)0x40048010))      // System Options Register 5
#define SIM_SOPT6                     (*((volatile uint32_t *)0x40048014))      // System Options Register 6
#define SIM_SOPT7                     (*((volatile uint32_t *)0x40048018))      // System Options Register 7
#define SIM_SDID                      (*((volatile uint32_t *)0x40048024))      // System Device Identification Register
#define SIM_SCGC1                     (*((volatile uint32_t *)0x40048028))      // System Clock Gating Control Register 1
#define SIM_SCGC2                     (*((volatile uint32_t *)0x4004802C))      // System Clock Gating Control Register 2
#define SIM_SCGC3                     (*((volatile uint32_t *)0x40048030))      // System Clock Gating Control Register 3
#define SIM_SCGC4                     (*((volatile uint32_t *)0x40048034))      // System Clock Gating Control Register 4
#define SIM_SCGC5                     (*((volatile uint32_t *)0x40048038))      // System Clock Gating Control Register 5
#define SIM_SCGC6                     (*((volatile uint32_t *)0x4004803C))      // System Clock Gating Control Register 6
#define SIM_SCGC7                     (*((volatile uint32_t *)0x40048040))      // System Clock Gating Control Register 7
#define SIM_CLKDIV1                   (*((volatile uint32_t *)0x40048044))      // System Clock Divider Register 1
#define SIM_CLKDIV2                   (*((volatile uint32_t *)0x40048048))      // System Clock Divider Register 2
#define SIM_FCFG1                     (*((volatile uint32_t *)0x4004804C))      // Flash Configuration Register 1
#define SIM_FCFG2                     (*((volatile uint32_t *)0x40048050))      // Flash Configuration Register 2
#define SIM_UIDH                      (*((volatile uint32_t *)0x40048054))      // Unique Identification Register High
#define SIM_UIDMH                     (*((volatile uint32_t *)0x40048058))      // Unique Identification Register Mid-High
#define SIM_UIDML                     (*((volatile uint32_t *)0x4004805C))      // Unique Identification Register Mid Low
#define SIM_UIDL                      (*((volatile uint32_t *)0x40048060))      // Unique Identification Register Low


//*****************************************************************************
//
// Mode Controller registers
//
//*****************************************************************************

#define MC_SRSH                       (*((volatile uint32_t *)0x0))      // System Reset Status Register High (MC_SRSH)
#define MC_SRSL                       (*((volatile uint32_t *)0x1))      // System Reset Status Register Low (MC_SRSL)
#define MC_PMPROT                     (*((volatile uint32_t *)0x2))      // Power Mode Protection Register (MC_PMPROT)
#define MC_PMCTRL                     (*((volatile uint32_t *)0x3))      // Power Mode Control Register (MC_PMCTRL)


//*****************************************************************************
//
// Power Management Controller registers
//
//*****************************************************************************

#define PMC_LVDSC1                    (*((volatile uint32_t *)0x4007D000))      // Low Voltage Detect Status and Control 1 Register
#define PMC_LVDSC2                    (*((volatile uint32_t *)0x4007D001))      // Low Voltage Detect Status and Control 2 Register
#define PMC_REGSC                     (*((volatile uint32_t *)0x4007D002))      // Regulator Status and Control Register


//*****************************************************************************
//
// Low-leakage wake-up unit (LLWU) registers
//
//*****************************************************************************

#define LLWU_PE1                      (*((volatile uint32_t *)0x4007C000))      // LLWU Pin Enable 1 Register (LLWU_PE1)
#define LLWU_PE2                      (*((volatile uint32_t *)0x4007C001))      // LLWU Pin Enable 2 Register (LLWU_PE2)
#define LLWU_PE3                      (*((volatile uint32_t *)0x4007C002))      // LLWU Pin Enable 3 Register (LLWU_PE3)
#define LLWU_PE4                      (*((volatile uint32_t *)0x4007C003))      // LLWU Pin Enable 4 Register (LLWU_PE4)
#define LLWU_ME                       (*((volatile uint32_t *)0x4007C004))      // LLWU Module Enable Register (LLWU_ME)
#define LLWU_F1                       (*((volatile uint32_t *)0x4007C005))      // LLWU Flag 1 Register (LLWU_F1)
#define LLWU_F2                       (*((volatile uint32_t *)0x4007C006))      // LLWU Flag 2 Register (LLWU_F2)
#define LLWU_F3                       (*((volatile uint32_t *)0x4007C007))      // LLWU Flag 3 Register (LLWU_F3)
#define LLWU_CS                       (*((volatile uint32_t *)0x4007C008))      // LLWU Control and Status Register (LLWU_CS)


//*****************************************************************************
//
// Miscellaneous Control Module (MCM) registers
//
//*****************************************************************************

#define MCM_PLASC                     (*((volatile uint32_t *)0xE0080008))      // Crossbar switch (AXBS) slave configuration
#define MCM_PLAMC                     (*((volatile uint32_t *)0xE008000A))      // Crossbar switch (AXBS) master configuration
#define MCM_SRAMAP                    (*((volatile uint32_t *)0xE008000C))      // SRAM arbitration and protection
#define MCM_ISR                       (*((volatile uint32_t *)0xE0080010))      // Interrupt status register
#define MCM_ETBCC                     (*((volatile uint32_t *)0xE0080014))      // ETB counter control register
#define MCM_ETBRL                     (*((volatile uint32_t *)0xE0080018))      // ETB reload register
#define MCM_ETBCNT                    (*((volatile uint32_t *)0xE008001C))      // ETB counter value register


//*****************************************************************************
//
// Crossbar Switch (AXBS) registers
//
//*****************************************************************************

#define AXBS_PRS0                     (*((volatile uint32_t *)0x40004000))      // Priority Registers Slave
#define AXBS_CRS0                     (*((volatile uint32_t *)0x40004010))      // Control Register
#define AXBS_PRS1                     (*((volatile uint32_t *)0x40004100))      // Priority Registers Slave
#define AXBS_CRS1                     (*((volatile uint32_t *)0x40004110))      // Control Register
#define AXBS_PRS2                     (*((volatile uint32_t *)0x40004200))      // Priority Registers Slave
#define AXBS_CRS2                     (*((volatile uint32_t *)0x40004210))      // Control Register
#define AXBS_PRS3                     (*((volatile uint32_t *)0x40004300))      // Priority Registers Slave
#define AXBS_CRS3                     (*((volatile uint32_t *)0x40004310))      // Control Register
#define AXBS_PRS4                     (*((volatile uint32_t *)0x40004400))      // Priority Registers Slave
#define AXBS_CRS4                     (*((volatile uint32_t *)0x40004410))      // Control Register
#define AXBS_PRS5                     (*((volatile uint32_t *)0x40004500))      // Priority Registers Slave
#define AXBS_CRS5                     (*((volatile uint32_t *)0x40004510))      // Control Register
#define AXBS_PRS6                     (*((volatile uint32_t *)0x40004600))      // Priority Registers Slave
#define AXBS_CRS6                     (*((volatile uint32_t *)0x40004610))      // Control Register
#define AXBS_PRS7                     (*((volatile uint32_t *)0x40004700))      // Priority Registers Slave
#define AXBS_CRS7                     (*((volatile uint32_t *)0x40004710))      // Control Register
#define AXBS_MGPCR0                   (*((volatile uint32_t *)0x40004800))      // Master General Purpose Control Register
#define AXBS_MGPCR1                   (*((volatile uint32_t *)0x40004900))      // Master General Purpose Control Register
#define AXBS_MGPCR2                   (*((volatile uint32_t *)0x40004A00))      // Master General Purpose Control Register
#define AXBS_MGPCR3                   (*((volatile uint32_t *)0x40004B00))      // Master General Purpose Control Register
#define AXBS_MGPCR4                   (*((volatile uint32_t *)0x40004C00))      // Master General Purpose Control Register
#define AXBS_MGPCR5                   (*((volatile uint32_t *)0x40004D00))      // Master General Purpose Control Register
#define AXBS_MGPCR6                   (*((volatile uint32_t *)0x40004E00))      // Master General Purpose Control Register
#define AXBS_MGPCR7                   (*((volatile uint32_t *)0x40004F00))      // Master General Purpose Control Register


//*****************************************************************************
//
// Memory Protection Unit (MPU) registers
//
//*****************************************************************************

#define MPU_CESR                      (*((volatile uint32_t *)0x4000D000))      // Control/Error Status Register (MPU_CESR)
#define MPU_EAR0                      (*((volatile uint32_t *)0x4000D010))      // Error Address Register, Slave Port n (MPU_EAR0)
#define MPU_EDR0                      (*((volatile uint32_t *)0x4000D014))      // Error Detail Register, Slave Port n (MPU_EDR0)
#define MPU_EAR1                      (*((volatile uint32_t *)0x4000D018))      // Error Address Register, Slave Port n (MPU_EAR1)
#define MPU_EDR1                      (*((volatile uint32_t *)0x4000D01C))      // Error Detail Register, Slave Port n (MPU_EDR1)
#define MPU_EAR2                      (*((volatile uint32_t *)0x4000D020))      // Error Address Register, Slave Port n (MPU_EAR2)
#define MPU_EDR2                      (*((volatile uint32_t *)0x4000D024))      // Error Detail Register, Slave Port n (MPU_EDR2)
#define MPU_EAR3                      (*((volatile uint32_t *)0x4000D028))      // Error Address Register, Slave Port n (MPU_EAR3)
#define MPU_EDR3                      (*((volatile uint32_t *)0x4000D02C))      // Error Detail Register, Slave Port n (MPU_EDR3)
#define MPU_EAR4                      (*((volatile uint32_t *)0x4000D030))      // Error Address Register, Slave Port n (MPU_EAR4)
#define MPU_EDR4                      (*((volatile uint32_t *)0x4000D034))      // Error Detail Register, Slave Port n (MPU_EDR4)
#define MPU_RGD0_WORD0                (*((volatile uint32_t *)0x4000D400))      // Region Descriptor n, Word 0 (MPU_RGD0_WORD0)
#define MPU_RGD0_WORD1                (*((volatile uint32_t *)0x4000D404))      // Region Descriptor n, Word 1 (MPU_RGD0_WORD1)
#define MPU_RGD0_WORD2                (*((volatile uint32_t *)0x4000D408))      // Region Descriptor n, Word 2 (MPU_RGD0_WORD2)
#define MPU_RGD0_WORD3                (*((volatile uint32_t *)0x4000D40C))      // Region Descriptor n, Word 3 (MPU_RGD0_WORD3)
#define MPU_RGD1_WORD0                (*((volatile uint32_t *)0x4000D410))      // Region Descriptor n, Word 0 (MPU_RGD1_WORD0)
#define MPU_RGD1_WORD1                (*((volatile uint32_t *)0x4000D414))      // Region Descriptor n, Word 1 (MPU_RGD1_WORD1)
#define MPU_RGD1_WORD2                (*((volatile uint32_t *)0x4000D418))      // Region Descriptor n, Word 2 (MPU_RGD1_WORD2)
#define MPU_RGD1_WORD3                (*((volatile uint32_t *)0x4000D41C))      // Region Descriptor n, Word 3 (MPU_RGD1_WORD3)
#define MPU_RGD2_WORD0                (*((volatile uint32_t *)0x4000D420))      // Region Descriptor n, Word 0 (MPU_RGD2_WORD0)
#define MPU_RGD2_WORD1                (*((volatile uint32_t *)0x4000D424))      // Region Descriptor n, Word 1 (MPU_RGD2_WORD1)
#define MPU_RGD2_WORD2                (*((volatile uint32_t *)0x4000D428))      // Region Descriptor n, Word 2 (MPU_RGD2_WORD2)
#define MPU_RGD2_WORD3                (*((volatile uint32_t *)0x4000D42C))      // Region Descriptor n, Word 3 (MPU_RGD2_WORD3)
#define MPU_RGD3_WORD0                (*((volatile uint32_t *)0x4000D430))      // Region Descriptor n, Word 0 (MPU_RGD3_WORD0)
#define MPU_RGD3_WORD1                (*((volatile uint32_t *)0x4000D434))      // Region Descriptor n, Word 1 (MPU_RGD3_WORD1)
#define MPU_RGD3_WORD2                (*((volatile uint32_t *)0x4000D438))      // Region Descriptor n, Word 2 (MPU_RGD3_WORD2)
#define MPU_RGD3_WORD3                (*((volatile uint32_t *)0x4000D43C))      // Region Descriptor n, Word 3 (MPU_RGD3_WORD3)
#define MPU_RGD4_WORD0                (*((volatile uint32_t *)0x4000D440))      // Region Descriptor n, Word 0 (MPU_RGD4_WORD0)
#define MPU_RGD4_WORD1                (*((volatile uint32_t *)0x4000D444))      // Region Descriptor n, Word 1 (MPU_RGD4_WORD1)
#define MPU_RGD4_WORD2                (*((volatile uint32_t *)0x4000D448))      // Region Descriptor n, Word 2 (MPU_RGD4_WORD2)
#define MPU_RGD4_WORD3                (*((volatile uint32_t *)0x4000D44C))      // Region Descriptor n, Word 3 (MPU_RGD4_WORD3)
#define MPU_RGD5_WORD0                (*((volatile uint32_t *)0x4000D450))      // Region Descriptor n, Word 0 (MPU_RGD5_WORD0)
#define MPU_RGD5_WORD1                (*((volatile uint32_t *)0x4000D454))      // Region Descriptor n, Word 1 (MPU_RGD5_WORD1)
#define MPU_RGD5_WORD2                (*((volatile uint32_t *)0x4000D458))      // Region Descriptor n, Word 2 (MPU_RGD5_WORD2)
#define MPU_RGD5_WORD3                (*((volatile uint32_t *)0x4000D45C))      // Region Descriptor n, Word 3 (MPU_RGD5_WORD3)
#define MPU_RGD6_WORD0                (*((volatile uint32_t *)0x4000D460))      // Region Descriptor n, Word 0 (MPU_RGD6_WORD0)
#define MPU_RGD6_WORD1                (*((volatile uint32_t *)0x4000D464))      // Region Descriptor n, Word 1 (MPU_RGD6_WORD1)
#define MPU_RGD6_WORD2                (*((volatile uint32_t *)0x4000D468))      // Region Descriptor n, Word 2 (MPU_RGD6_WORD2)
#define MPU_RGD6_WORD3                (*((volatile uint32_t *)0x4000D46C))      // Region Descriptor n, Word 3 (MPU_RGD6_WORD3)
#define MPU_RGD7_WORD0                (*((volatile uint32_t *)0x4000D470))      // Region Descriptor n, Word 0 (MPU_RGD7_WORD0)
#define MPU_RGD7_WORD1                (*((volatile uint32_t *)0x4000D474))      // Region Descriptor n, Word 1 (MPU_RGD7_WORD1)
#define MPU_RGD7_WORD2                (*((volatile uint32_t *)0x4000D478))      // Region Descriptor n, Word 2 (MPU_RGD7_WORD2)
#define MPU_RGD7_WORD3                (*((volatile uint32_t *)0x4000D47C))      // Region Descriptor n, Word 3 (MPU_RGD7_WORD3)
#define MPU_RGD8_WORD0                (*((volatile uint32_t *)0x4000D480))      // Region Descriptor n, Word 0 (MPU_RGD8_WORD0)
#define MPU_RGD8_WORD1                (*((volatile uint32_t *)0x4000D484))      // Region Descriptor n, Word 1 (MPU_RGD8_WORD1)
#define MPU_RGD8_WORD2                (*((volatile uint32_t *)0x4000D488))      // Region Descriptor n, Word 2 (MPU_RGD8_WORD2)
#define MPU_RGD8_WORD3                (*((volatile uint32_t *)0x4000D48C))      // Region Descriptor n, Word 3 (MPU_RGD8_WORD3)
#define MPU_RGD9_WORD0                (*((volatile uint32_t *)0x4000D490))      // Region Descriptor n, Word 0 (MPU_RGD9_WORD0)
#define MPU_RGD9_WORD1                (*((volatile uint32_t *)0x4000D494))      // Region Descriptor n, Word 1 (MPU_RGD9_WORD1)
#define MPU_RGD9_WORD2                (*((volatile uint32_t *)0x4000D498))      // Region Descriptor n, Word 2 (MPU_RGD9_WORD2)
#define MPU_RGD9_WORD3                (*((volatile uint32_t *)0x4000D49C))      // Region Descriptor n, Word 3 (MPU_RGD9_WORD3)
#define MPU_RGD10_WORD0               (*((volatile uint32_t *)0x4000D4A0))      // Region Descriptor n, Word 0 (MPU_RGD10_WORD0)
#define MPU_RGD10_WORD1               (*((volatile uint32_t *)0x4000D4A4))      // Region Descriptor n, Word 1 (MPU_RGD10_WORD1)
#define MPU_RGD10_WORD2               (*((volatile uint32_t *)0x4000D4A8))      // Region Descriptor n, Word 2 (MPU_RGD10_WORD2)
#define MPU_RGD10_WORD3               (*((volatile uint32_t *)0x4000D4AC))      // Region Descriptor n, Word 3 (MPU_RGD10_WORD3)
#define MPU_RGD11_WORD0               (*((volatile uint32_t *)0x4000D4B0))      // Region Descriptor n, Word 0 (MPU_RGD11_WORD0)
#define MPU_RGD11_WORD1               (*((volatile uint32_t *)0x4000D4B4))      // Region Descriptor n, Word 1 (MPU_RGD11_WORD1)
#define MPU_RGD11_WORD2               (*((volatile uint32_t *)0x4000D4B8))      // Region Descriptor n, Word 2 (MPU_RGD11_WORD2)
#define MPU_RGD11_WORD3               (*((volatile uint32_t *)0x4000D4BC))      // Region Descriptor n, Word 3 (MPU_RGD11_WORD3)
#define MPU_RGDAAC0                   (*((volatile uint32_t *)0x4000D800))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC0)
#define MPU_RGDAAC1                   (*((volatile uint32_t *)0x4000D804))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC1)
#define MPU_RGDAAC2                   (*((volatile uint32_t *)0x4000D808))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC2)
#define MPU_RGDAAC3                   (*((volatile uint32_t *)0x4000D80C))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC3)
#define MPU_RGDAAC4                   (*((volatile uint32_t *)0x4000D810))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC4)
#define MPU_RGDAAC5                   (*((volatile uint32_t *)0x4000D814))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC5)
#define MPU_RGDAAC6                   (*((volatile uint32_t *)0x4000D818))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC6)
#define MPU_RGDAAC7                   (*((volatile uint32_t *)0x4000D81C))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC7)
#define MPU_RGDAAC8                   (*((volatile uint32_t *)0x4000D820))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC8)
#define MPU_RGDAAC9                   (*((volatile uint32_t *)0x4000D824))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC9)
#define MPU_RGDAAC10                  (*((volatile uint32_t *)0x4000D828))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC10)
#define MPU_RGDAAC11                  (*((volatile uint32_t *)0x4000D82C))      // Region Descriptor Alternate Access Control n (MPU_RGDAAC11)


//*****************************************************************************
//
// Peripheral Bridge (AIPS-Lite) registers
//
//*****************************************************************************

