MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60DN512ZVLQ10/mcu.h
#define PADDR2                        0x7FFF80000000      // Bytes 4 (bits 31:24) and 5 (bits 23:16) of the 6-byte individual address used for exact match, and the source address field in PAUSE frames.
#define TYPE                          0x7FFF8000      // Type field in PAUSE frames.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_OPD register.
//
//*****************************************************************************

#define OPCODE                        0x7FFF80000000      // Opcode field in PAUSE frames
#define PAUSE_DUR                     0x7FFF8000      // Pause duration


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IAUR register.
//
//*****************************************************************************

#define IADDR1                        0x7FFFFFFF80000000      // The upper 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a unicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IALR register.
//
//*****************************************************************************

#define IADDR2                        0x7FFFFFFF80000000      // The lower 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a unicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_GAUR register.
//
//*****************************************************************************

#define GADDR1                        0x7FFFFFFF80000000      // Contains the upper 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a multicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_GALR register.
//
//*****************************************************************************

#define GADDR2                        0x7FFFFFFF80000000      // Contains the lower 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a multicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TFWR register.
//
//*****************************************************************************

#define STRFWD                        0x00000100      // Store and forward enable
#define -                             0x00000180      // This read-only field is reserved and always has the value zero.
#define TFWR                          0x000007E0      // Transmit FIFO write


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RDSR register.
//
//*****************************************************************************

#define R_DES_START                   0xFFFFFFF80000000      // Pointer to the start of the receive buffer descriptor queue.
#define -                             0x0000001C      // This read-only field is reserved and always has the value zero.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TDSR register.
//
//*****************************************************************************

#define X_DES_START                   0xFFFFFFF80000000      // Pointer to the start of the transmit buffer descriptor queue.
#define -                             0x0000001C      // This read-only field is reserved and always has the value zero.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_MRBR register.
//
//*****************************************************************************

#define -                             0x1FFFF80000000      // This read-only field is reserved and always has the value zero.
#define R_BUF_SIZE                    0x007FE000      // Receive buffer size in bytes.
#define -                             0x00000078      // This read-only field is reserved and always has the value zero.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RSFL register.
//
//*****************************************************************************

#define -                             0x7FFFFF80000000      // This read-only field is reserved and always has the value zero.
#define RX_SECTION_FULL               0x00007F80      // Value of receive FIFO section full threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RSEM register.
//
//*****************************************************************************

#define -                             0x7FFFFF80000000      // This read-only field is reserved and always has the value zero.
#define RX_SECTION_EMPTY              0x00007F80      // Value of the receive FIFO section empty threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RAEM register.
//
//*****************************************************************************

#define -                             0x7FFFFF80000000      // This read-only field is reserved and always has the value zero.
#define RX_ALMOST_EMPTY               0x00007F80      // Value of the receive FIFO almost empty threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RAFL register.
//
//*****************************************************************************

#define -                             0x7FFFFF80000000      // This read-only field is reserved and always has the value zero.
#define RX_ALMOST_FULL                0x00007F80      // Value of the receive FIFO almost full threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TSEM register.
//
//*****************************************************************************

#define -                             0x7FFFFF80000000      // This read-only field is reserved and always has the value zero.
#define TX_SECTION_EMPTY              0x00007F80      // Value of the transmit FIFO section empty threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TAEM register.
//
//*****************************************************************************

#define -                             0x7FFFFF80000000      // This read-only field is reserved and always has the value zero.
#define TX_ALMOST_EMPTY               0x00007F80      // Value of transmit FIFO almost empty threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TAFL register.
//
//*****************************************************************************

#define -                             0x7FFFFF80000000      // This read-only field is reserved and always has the value zero.
#define TX_ALMOST_FULL                0x00007F80      // Value of the transmit FIFO almost full threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TIPG register.
//
//*****************************************************************************

#define -                             0x3FFFFFF80000000      // This read-only field is reserved and always has the value zero.
#define IPG                           0x000001F0      // Transmit inter-packet gap


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_FTRL register.
//
//*****************************************************************************

#define -                             0x1FFFF80000000      // This read-only field is reserved and always has the value zero.
#define TRUNC_FL                      0x07FFE000      // Frame truncation length


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TACC register.
//
//*****************************************************************************

#define -                             0x3FFFFFF80000000      // This read-only field is reserved and always has the value zero.
#define PROCHK                        0x00000010      // Enables insertion of protocol checksum.
#define IPCHK                         0x00000008      // Enables insertion of IP header checksum.
#define -                             0x0000000C      // This read-only field is reserved and always has the value zero.
#define SHIFT16                       0x00000001      // TX FIFO shift-16


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RACC register.
//
//*****************************************************************************

#define -                             0x7FFFFF80000000      // This read-only field is reserved and always has the value zero.
#define SHIFT16                       0x00000080      // RX FIFO shift-16
#define LINEDIS                       0x00000040      // Enable discard of frames with MAC layer errors
#define -                             0x000000E0      // This read-only field is reserved and always has the value zero.
#define PRODIS                        0x00000004      // Enable discard of frames with wrong protocol checksum
#define IPDIS                         0x00000002      // Enable discard of frames with wrong IPv4 header checksum.
#define PADREM                        0x00000001      // Enable padding removal for short IP frames.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATCR register.
//
//*****************************************************************************

#define -                             0x1FFFF80000000      // This read-only field is reserved and always has the value zero.
#define SLAVE                         0x00002000      // Enable timer slave mode
#define -                             0x00001000      // This read-only field is reserved and always has the value zero.
#define CAPTURE                       0x00000800      // Capture timer value
#define -                             0x00000400      // This read-only field is reserved and always has the value zero.
#define RESTART                       0x00000200      // Reset timer
#define -                             0x00000100      // This read-only field is reserved and always has the value zero.
#define PINPER                        0x00000080      // Enables event signal output assertion on period event.
#define -                             0x000000C0      // This read-only field is reserved and always has the value zero.
#define PEREN                         0x00000010      // Enable periodical event
#define OFFRST                        0x00000008      // Reset timer on offset event
#define OFFEN                         0x00000004      // Enable one-shot offset event
#define -                             0x00000002      // This read-only field is reserved and always has the value zero.
#define EN                            0x00000001      // Enable timer


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATVR register.
//
//*****************************************************************************

#define ATIME                         0x7FFFFFFF80000000      // A write sets the timer. A read returns the last captured value. To read the current value, issue a capture command (set ATCR[CAPTURE]) prior to reading this register.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATOFF register.
//
//*****************************************************************************

#define OFFSET                        0x7FFFFFFF80000000      // Offset value for one-shot event generation. When the timer reaches the value an event can be generated to reset the counter. If the increment value in ATINC is given in true nanoseconds, this value is also given in true nanoseconds.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATPER register.
//
//*****************************************************************************

